In [2]:
df = DataFrame({'key1':list('aabba'),
               'key2':['one','two','one','two','one'],
               'data1':np.random.randn(5),
               'data2':np.random.randn(5)})

In [3]:
df

  key1 key2     data1     data2
0    a  one -0.421974  0.469832
1    a  two  0.174387  0.162985
2    b  one  0.791176 -0.346350
3    b  two  0.030570 -0.241184
4    a  one  1.152320 -0.405686

In [4]:
grouped = df['data1'].groupby(df['key1'])

In [5]:
grouped

In [7]:
grouped.describe()

,count,mean,std,min,25%,50%,75%,max
key1,,,,,,,,
a,3.0,0.301578,0.794817,-0.421974,-0.123793,0.174387,0.663354,1.152320
b,2.0,0.410873,0.537830,0.030570,0.220722,0.410873,0.601024,0.791176

In [17]:
df[['key1','data1']].groupby('key1').mean()

         data1
key1
a     0.301578
b     0.410873

In [16]:
df[['key1','data1']]

  key1     data1
0    a -0.421974
1    a  0.174387
2    b  0.791176
3    b  0.030570
4    a  1.152320

In [20]:
stats = np.array(['ohio','california','california','ohio','ohio'])
years = np.array([2005,2005,2006,2005,2006])

In [21]:
df['data1'].groupby([stats,years]).mean()

california  2005    0.174387
            2006    0.791176
ohio        2005   -0.195702
            2006    1.152320
Name: data1, dtype: float64

In [22]:
df.groupby('key1').mean()

         data1     data2
key1
a     0.301578  0.075710
b     0.410873 -0.293767

In [25]:
df.groupby('key1').describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0  0.301578  0.794817 -0.421974 -0.123793  0.174387  0.663354
b      2.0  0.410873  0.537830  0.030570  0.220722  0.410873  0.601024

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     1.152320   3.0  0.075710  0.444236 -0.405686 -0.121351  0.162985
b     0.791176   2.0 -0.293767  0.074364 -0.346350 -0.320059 -0.293767


           75%       max
key1
a     0.316408  0.469832
b    -0.267475 -0.241184

In [28]:
for name,group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one -0.421974  0.469832
1    a  two  0.174387  0.162985
4    a  one  1.152320 -0.405686
b
  key1 key2     data1     data2
2    b  one  0.791176 -0.346350
3    b  two  0.030570 -0.241184

In [32]:
df.groupby('key1')['data1'].mean()

key1
a    0.301578
b    0.410873
Name: data1, dtype: float64

In [35]:
pieces = dict(list(df.groupby('key1')))

In [44]:
pieces['a'].set_index(['key1','key2']).loc[('a','two'),'data1'].unstack()

c:\python36\lib\site-packages\pandas\core\indexing.py:1472: PerformanceWarning: indexing past lexsort depth may impact performance.
  return self._getitem_tuple(key)

key2       two
key1
a     0.174387

In [47]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [48]:
people = DataFrame(np.random.randn(5,5),
                  columns=list('abcde'),
                  index=['joe','steve','wes','jim','travis'])

In [49]:
people

               a         b         c         d         e
joe    -0.220025 -1.256190  0.006339  1.223334 -1.460030
steve  -0.455532 -0.169069 -2.082521  1.321104  0.509316
wes     0.833916 -0.388695  0.586150 -0.264604 -0.325989
jim    -0.997914 -1.001209 -0.852611 -0.020278  2.602777
travis  0.254893 -0.091928  0.661042  0.323968  0.102136

In [52]:
people.loc[2:3,['b','c']]= np.nan

In [53]:
people

               a         b         c         d         e
joe    -0.220025 -1.256190  0.006339  1.223334 -1.460030
steve  -0.455532 -0.169069 -2.082521  1.321104  0.509316
wes     0.833916       NaN       NaN -0.264604 -0.325989
jim    -0.997914 -1.001209 -0.852611 -0.020278  2.602777
travis  0.254893 -0.091928  0.661042  0.323968  0.102136

In [55]:
mappitng = {'a':'red','b':'red','c':'blue','d':'blue','e':'red','f':'orange'}

In [56]:
mappitng

{'a': 'red', 'b': 'red', 'c': 'blue', 'd': 'blue', 'e': 'red', 'f': 'orange'}

In [58]:
people.groupby(mappitng,axis=1).sum()

            blue       red
joe     1.229673 -2.936244
steve  -0.761417 -0.115285
wes    -0.264604  0.507927
jim    -0.872889  0.603654
travis  0.985010  0.265101

In [59]:
map_series = Series(mappitng)

In [60]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [61]:
people.groupby(map_series,axis=1).sum()

            blue       red
joe     1.229673 -2.936244
steve  -0.761417 -0.115285
wes    -0.264604  0.507927
jim    -0.872889  0.603654
travis  0.985010  0.265101

In [62]:
people.groupby(len).sum()

          a         b         c         d         e
3 -0.384023 -2.257398 -0.846272  0.938453  0.816758
5 -0.455532 -0.169069 -2.082521  1.321104  0.509316
6  0.254893 -0.091928  0.661042  0.323968  0.102136

In [63]:
columns = pd.MultiIndex.from_arrays([['us','us','us','jp','jp'],[1,3,5,1,3]],names=['cty','tenor'])

In [64]:
hier_df = DataFrame(np.random.randn(4,5),columns=columns)

In [65]:
hier_df

cty          us                            jp
tenor         1         3         5         1         3
0      0.037335  0.616592 -0.309635 -2.975028  0.374167
1      2.916820 -0.013423  2.314217  0.773501  0.952111
2      0.811875 -0.568809 -1.066911 -0.657273  0.300749
3      0.231939 -0.351377 -0.091168  0.828565  1.074871

In [66]:
hier_df.groupby(level=0,axis=1).count()

cty  jp  us
0     2   3
1     2   3
2     2   3
3     2   3